[
  {
    "relationships": 11,
    "elements": 11,
    "name": "BuildingManagement",
    "description": "Project description:\nEach web portal has a version number and a URL address such as “http://www.ebuntu-nrw.org” and provides a catalog of buildings with their energy information. A building has a unique ID, a name, an energy class (A, B, C, D), an address, a year of construction and is assigned to a user as the owner, who can add additional entries to the buildings. Each additional entry has a name. An entry can be either textual information or a floating point number with an additional unit (the latter as freely definable text). The owner can optionally release each of these additional entries publicly, i.e. also for all non-registered visitors to the respective web portal. In addition, each building has a number of images, one of which is used as a profile photo. Images are saved with a file name.\nVisitors can register with a web portal as a user with a unique user name, their email address and a password. During registration, the system checks the user name for uniqueness and the correct email address by sending a confirmation link. In the meantime, the user is set up for the web portal by an administrator. Once these processes have been completed, users are automatically informed by email that they have been activated and can log in accordingly. After logging in, users can create buildings, manage entries for their buildings and comment on other users' buildings. All visitors to the site can search for corresponding buildings in the system using a full-text search. Administrators are special users. Their ID card number is stored in addition to their user information. The administrative functions include setting up user accounts and deleting comments. \n\nCreate a UML use case diagram based on the project description. Assign the use cases to the corresponding actors. For the evaluation of the task, 10 meaningful use cases are sufficient. Use the concepts of generalization and, if possible, model meaningful relationships between the individual use cases."
  },
  {
    "relationships": 7,
    "elements": 6,
    "name": "GameArea",
    "description": ""
  },
  {
    "relationships": 10,
    "elements": 10,
    "name": "University",
    "description": "A university consists of several faculties, which are made up of various institutes. Each faculty and institute has a name. The address of each institute is known. \nEach faculty is headed by a dean, who is an employee of the university. \nThe total number of employees is known. Employees have a social security number, a name, and an email address. A distinction is made between research and administrative staff. \nResearch assistants (RA) are assigned to at least one institute. The field of research of each RA is known. In addition, RAs can be involved in projects for a certain number of hours, whereby the name, start and end dates of the projects are known. Some RAs teach courses. In this case, they are referred to as lecturers. \nCourses have a unique number (ID), a name and a weekly duration in hours."
  },
  {
    "relationships": 15,
    "elements": 11,
    "name": "Kinepolis",
    "description": "Kinepolis owns several cinemas in different towns.  Each cinema has several theatres in which several shows can be programmed per day.  Every cinema needs its own copy of the movie, and possibly more than one if a movie is to be played simultaneously in more than one theatre.  A copy will only be shown in the theatres of the premise where the copy is located. But copies of movies can be moved to another cinema if required by the programming.  \r\nEvery Sunday, the program for the next week is published (from Wednesday to Tuesday). Once a show has been published on the website, people can start making on-line reservations for that show. \r\nReservation can be made up to 1 hour before the starting time of the show and must be paid with a credit card.  A seat reservation can be cancelled by the customer up to 24h before the starting time of the show.  For that reason, credit cards are debited only after the cancellation period is terminated.\r\nA published show can be cancelled by Kinepolis as long as there are no seat reservations for that show.  If there are any, the reservations must be cancelled first.  When possible, a new seat is offered for a show for the same movie in another theatre.  The customer can accept or decline the offer.  The offer expires 24 hours before the start of the show. If the offer is declined, expired or no new seat reservation can be offered, the customer receives a free ticket send at home. \r\nPeople who did not make a seat reservation can buy a ticket at the entrance.  The tickets will also be assigned a seat number.  In contrast with on-line seat reservations, tickets issued at the entrance are anonymous and cannot be cancelled or refunded. At the ticketing desk a display shows how many seats are still available for that show (according to the number of seats in the theatre)."
  },
  {
    "relationships": 10,
    "elements": 9,
    "name": "eHome2020",
    "description": "As a project manager of a medium-sized software company you are responsible for the successful implementation of the system described below. In the first 5 tasks of this exam you will produce a specification step-by-step.\nShort description:\nInfrastructure and software platform for capturing energy consumption data in private homes.\nThe customer:\nHomeTec is a small company in the domain of building engineering which manufactures sensors which can be installed in private homes. The company is, same as your company, located in Aachen. \nDetailed system description:\nThe system “E-Home-2020” consists of a set of multiple sensors, which report their values to a connected SensorController. Furthermore, the SensorController stores information about the apartment with its inhabitants. The apartment’s inhabitants can log on to the SensorController by using their username and password and query values for each installed sensor. Moreover, they can specify a threshold for each sensor. An external System called „E-Monitor“  is attached to the system and checks all thresholds for each sensor automatically. If the sensor’s threshold is exceeded and if an email address has been specified for the apartment, “E-Monitor” will send alert messages via the “E-Home-2020” system. \nSome inhabitants have administrative rights which enable them to configure sensors. This includes assigning sensors to a new room or changing the sensor’s description.\nAt the moment, the company HomeTec manufactures two types of sensors: temperature sensors and power sensors (the latter are installed in a plug-and-play fashion between the power-socket and the respective appliance). Temperature sensors have a valid value range (min , max). Power sensors store the total power consumption as counter reading. All sensors have a unique vendor-id, a description (e.g. “temperature radiator living room” or “power consumption microwave oven”) and a unit. Possible units are CELSIUS and WATT. Each sensor is assigned to exactly one room. An apartment has an address and consists of at least two rooms. Rooms have a description (e.g. „living room“). For each sensor one can query the respective measured values, which are stored in the system. Each value has a timestamp and the corresponding value as a floating point number. For quick access one can access the last value of a sensor directly.\nGoal of project:\nThe goal of the project is the development of a prototype, which works on a specific target platform in a specific environment and provides essential functionality."
  },
  {
    "relationships": 13,
    "elements": 13,
    "name": "CardGameApp",
    "description": "You are in the process of designing a card game app for German clubs. You are thinking about the data structure of the system in more detail. You have been given the following specification of the system by the customer:\nA game consists of 4 players, a deck of cards and a scoring table. A deck consists of up to 48 cards. Cards have a comparison method for card height, which can return lower, equal or higher. The suits of the cards are diamonds, hearts, spades and clubs.\nThe scoring table consists of any number of rounds, with each round containing the winning players and the point value. A round can be both a jack round and a solo round. In addition, mandatory solo rounds are a special case of solo rounds. Solo rounds have one type of solo, which can be a trump, jack or queen solo. In addition, solo rounds have exactly one solo player.\nEach object has a unique ID attribute, which ensures that it can be found."
  },
  {
    "relationships": 5,
    "elements": 6,
    "name": "BankAccount",
    "description": "The following description of a bank is given. Create a suitable class diagram from the given informal description.\nA bank manages any number of customers. The first name and last name of type String are stored for each customer. A bank consists of any number of branches. A customer has at least one and at most five accounts. Each account has an owner who is a customer of the bank. There are two basic types of accounts: Current accounts and savings accounts. Each account has an account number of type int and a current account balance of type double. Current accounts also have an overdraft limit of type double."
  },
  {
    "relationships": 6,
    "elements": 6,
    "name": "Boeing",
    "description": ""
  },
  {
    "relationships": 10,
    "elements": 8,
    "name": "TruckLogistics",
    "description": "Locations consist of drivers with first and last names and vehicles. Each location has its own address. There are three types of vehicles: trucks, cars and vans. Each vehicle has a vehicle number. While trucks also have a certain weight, passenger cars have a certain number of seats. In addition to vehicles and drivers, orders are also managed. Orders are carried out by drivers. Drivers carry out a maximum of one order assigned to them at any one time. Orders always have an origin and a destination location, at least one assigned driver and the date of execution. In addition to order management, the system also records which vehicles are driven by which driver. For this purpose, vehicles are assigned up to one driver who drives these vehicles."
  },
  {
    "relationships": 10,
    "elements": 10,
    "name": "Ebike",
    "description": "Generate a class diagram of an EBike according to these specifications:\r\nThe EBike is composed of a frame (made out of steel), a drive system, and a controller.\r\nTwo wheels are inserted into each frame. The drive system is composed of a motor.\r\nEach EBike can be connected to a removable battery. The battery has a stored energy\r\nmeasured in Watt-hours (Wh). The controller can be in one of three states: On, Off, and\r\nCharging. It also controls the battery, if one is connected, and commands the drive\r\nsystem. The company plans two different variants of the controller, a basic controller,\r\nand an advanced controller. The advanced controller should be able to estimate the\r\nnext Date the bike should be inspected for maintenance."
  }
]